## Production: hosted_zone
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |               NAME                |
|----------|-----------------------------------|
| add      | `aws_route53_zone.form_viewer[1]` |
| recreate | `aws_route53_zone.form_viewer[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_zone.form_viewer[0] must be replaced
  # (moved from aws_route53_zone.form_viewer)
-/+ resource "aws_route53_zone" "form_viewer" {
      ~ arn           = "arn:aws:route53:::hostedzone/Z1031499PBK3926Y7HKK" -> (known after apply)
      ~ id            = "Z1031499PBK3926Y7HKK" -> (known after apply)
      ~ name          = "forms-formulaires.alpha.canada.ca" -> "forms-formulaires.canada.ca" # forces replacement
      ~ name_servers  = [
          - "ns-1172.awsdns-18.org",
          - "ns-1786.awsdns-31.co.uk",
          - "ns-403.awsdns-50.com",
          - "ns-766.awsdns-31.net",
        ] -> (known after apply)
        tags          = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ zone_id       = "Z1031499PBK3926Y7HKK" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_route53_zone.form_viewer[1] will be created
  + resource "aws_route53_zone" "form_viewer" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "forms-formulaires.alpha.canada.ca"
      + name_servers  = (known after apply)
      + tags          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - hosted_zone_id    = "Z1031499PBK3926Y7HKK" -> null
  + hosted_zone_ids   = [
      + null,
      + null,
    ]
  - hosted_zone_name  = "forms-formulaires.alpha.canada.ca" -> null
  + hosted_zone_names = [
      + "forms-formulaires.canada.ca",
      + "forms-formulaires.alpha.canada.ca",
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
